package com.example.lesson1;

public class paragraph1 {
    /*
    * В темной комнате рассыпано 10 монет, 5 из них повернуты аверсом, 5 – реверсом.
    * Разделите монеты на две кучки таким образом, чтобы в каждой количество монет,
    * повернутых аверсом, было одинаковым.
    *
    * Ответ: сделаем 2 произвольные кучи по 5 момнет, т.к. изначально количество монет
    * аверсом == количеству монет реверсом, то эти кучи будут зеркальными,т.е. имеем
    * следущие варианты:
    *       1куча                       2 куча
    *   1   5-реверсом, 0 аверсом   0-реверсом,5-аверсом
    *    1   4-реверсом, 1 аверсом   1-реверсом,4-аверсом
    *    1   3-реверсом, 2 аверсом   2-реверсом,3-аверсом
    *    1   2-реверсом, 3 аверсом   3-реверсом,2-аверсом
    *    1   1-реверсом, 4 аверсом   4-реверсом,1-аверсом
    *
    * Отсюда следует, что перевернув все монеты в одной из куч, мы получим две одинаковых кучи.
    * */
}
