package com.example.lesson1;

public class paragraph3 {

    /*
    * Если привязать шарик с гелием в автомобиле, то куда он будет отклоняться при резком нажатии на газ?
    *
    * Ответ: Гелий гораздо легче воздуха. В привычном виде шарик стремится улететь вверх т.к. чем ближе к
    * поверхности земли тем больше плотность воздуха и за счет этого воздух его как бы выталкивает наверх.
    * При начале движения автомобиля происходит тоже самое, но в горизонтальном положении: в задней части
    * автомобиля плотность воздуха возрастает и толкает шарик ВПЕРЕД.
    *
    *
    */
}
